tap "charmbracelet/tap"
tap "homebrew/services"
tap "proshunsuke/colmsg"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "ynqa/tap"
brew "openssl@3"
brew "python@3.13"
brew "autojump"
brew "bat"
brew "broot"
brew "coreutils"
brew "duckdb"
brew "eza"
brew "fd"
brew "tesseract"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "llm"
brew "luarocks"
brew "mecab"
brew "mecab-ipadic"
brew "mise"
brew "neofetch"
brew "nginx", restart_service: :changed
brew "ni"
brew "nkf"
brew "pandoc"
brew "pinact"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "postgresql@16"
brew "pstree"
brew "pueue", restart_service: :changed
brew "ripgrep"
brew "scrcpy"
brew "screenfetch", args: ["HEAD"]
brew "starship"
brew "tailscale"
brew "tesseract-lang"
brew "tldr"
brew "tree"
brew "tree-sitter"
brew "typos-cli"
brew "watch"
brew "zellij"
brew "zig"
brew "zlib"
brew "zoxide"
brew "charmbracelet/tap/gum"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "ynqa/tap/jnv"
cask "alacritty"
cask "android-platform-tools"
cask "basictex"
cask "claude-code"
cask "codex"
cask "font-cica"
cask "font-hackgen-nerd"
cask "gcloud-cli"
cask "libreoffice"
cask "mitmproxy"
cask "ngrok"
cask "wave"
cask "wezterm@nightly"
vscode "1yib.rust-bundle"
vscode "1yib.svelte-bundle"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "adam-bender.commit-message-editor"
vscode "aki77.rails-db-schema"
vscode "aldijav.golangwithdidi"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "antfu.browse-lite"
vscode "antfu.goto-alias"
vscode "anthropic.claude-code"
vscode "ardenivanov.svelte-intellisense"
vscode "arjun.swagger-viewer"
vscode "biomejs.biome"
vscode "boto3typed.boto3-ide"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "casualjim.gotemplate"
vscode "christian-kohler.npm-intellisense"
vscode "cjay.ruby-and-rails-snippets"
vscode "clarkyu.vscode-sql-beautify"
vscode "clemenspeters.format-json"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "cognition.devin"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "cymonk.sql-formatter"
vscode "dart-code.dart-code"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "factory.factory-vscode-extension"
vscode "figma.figma-vscode-extension"
vscode "fivethree.vscode-svelte-snippets"
vscode "forevolve.git-extensions-for-vs-code"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "honnamkuan.golang-snippets"
vscode "howardzuo.vscode-git-tags"
vscode "hridoy.rails-snippets"
vscode "htmlhint.vscode-htmlhint"
vscode "huizhou.githd"
vscode "hwencc.html-tag-wrapper"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "karunamurti.rspec-snippets"
vscode "katjanakosic.vscode-json5"
vscode "kevinrose.vsc-python-indent"
vscode "luanpotter.dart-import"
vscode "mathiasfrohlich.kotlin"
vscode "matt-meyers.vscode-dbml"
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "mohd-akram.vscode-html-format"
vscode "moonbit.moonbit-lang"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "neonxp.gotools"
vscode "nhoizey.gremlins"
vscode "nmrmsys.vscode-sql-formatter-mod"
vscode "nuxt.mdc"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "ocamllabs.ocaml-platform"
vscode "onecentlin.laravel-blade"
vscode "openai.chatgpt"
vscode "pengyifu.x8664assemblys"
vscode "peterj.proto"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "plex.vscode-regolint"
vscode "pmneo.tsimporter"
vscode "premparihar.gotestexplorer"
vscode "prime31.zig"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "rodrigorahman.flutter-dart-utils"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sadeghpm.sql-snippets"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shufo.vscode-blade-formatter"
vscode "sianglim.slim"
vscode "sidthesloth.html5-boilerplate"
vscode "sixth.sixth-ai"
vscode "steoates.autoimport"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "technosophos.vscode-helm"
vscode "timonwong.shellcheck"
vscode "tsandall.opa"
vscode "tscpp.proto-lang"
vscode "twxs.cmake"
vscode "vinirossa.vscode-gitandgithub-pack"
vscode "vivaxy.vscode-conventional-commits"
vscode "vortizhe.simple-ruby-erb"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "wscats.html-snippets"
vscode "xabikos.javascriptsnippets"
vscode "yokoe.vscode-postfix-go"
vscode "yzhang.markdown-all-in-one"
vscode "zarifprogrammer.tailwind-snippets"
vscode "ziglang.vscode-zig"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
go "github.com/air-verse/air"
go "github.com/daixiang0/gci"
go "golang.org/dl/go1.24.0"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "go.uber.org/mock/mockgen"
go "github.com/aarondl/sqlboiler/v4"
go "github.com/aarondl/sqlboiler/v4/drivers/sqlboiler-psql"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-generate"
cargo "needle-cli"
cargo "pueue"
cargo "rainfrog"
cargo "similarity-ts"
