tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "ktr0731/evans"
tap "weaveworks/tap"
brew "alp"
brew "anyenv"
brew "awscli"
brew "bash"
brew "bzip2"
brew "glib"
brew "libffi"
brew "python@3.9"
brew "coreutils"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "gcc"
brew "open-mpi"
brew "fftw"
brew "fzf"
brew "gdk-pixbuf"
brew "ghq"
brew "git-secrets"
brew "gnu-sed"
brew "gnuplot"
brew "python@3.10"
brew "gobject-introspection"
brew "golang-migrate"
brew "goreleaser"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kdoctor"
brew "krb5"
brew "libfido2"
brew "libiconv"
brew "libzip"
brew "make"
brew "protobuf"
brew "mysql"
brew "neovim"
brew "openssl@3"
brew "node-build"
brew "nodenv"
brew "peco"
brew "postgresql@12"
brew "pre-commit"
brew "redis"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "sl"
brew "sqlc"
brew "swiftlint"
brew "tfenv"
brew "tmux"
brew "tree"
brew "vips"
brew "wget"
brew "yq"
brew "go-swagger/go-swagger/go-swagger"
brew "ktr0731/evans/evans"
brew "weaveworks/tap/eksctl"
